studiohsoftware/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# FBA MKR1000 
# -----------------------
fba_mkr1000.name=Fueled By Anger (MKR1000)
fba_mkr1000.vid.0=0x1209
fba_mkr1000.pid.0=0xFBA0
fba_mkr1000.upload.tool=bossac
fba_mkr1000.upload.protocol=sam-ba
fba_mkr1000.upload.maximum_size=262144
fba_mkr1000.upload.maximum_data_size=32768
fba_mkr1000.upload.use_1200bps_touch=true
fba_mkr1000.upload.wait_for_upload_port=true
fba_mkr1000.upload.native_usb=true
fba_mkr1000.build.mcu=cortex-m0plus
fba_mkr1000.build.f_cpu=48000000L
fba_mkr1000.build.usb_product="Studio H Software USB Midi"
fba_mkr1000.build.usb_manufacturer="Studio H Software"
fba_mkr1000.build.board=SAMD_MKR1000
fba_mkr1000.build.core=arduino
fba_mkr1000.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
fba_mkr1000.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
fba_mkr1000.build.openocdscript=openocd_scripts/arduino_zero.cfg
fba_mkr1000.build.variant=fba_mkr1000
fba_mkr1000.build.vid=0x1209
fba_mkr1000.build.pid=0xFBA0
fba_mkr1000.bootloader.tool=openocd
fba_mkr1000.bootloader.file=mkr1000/samd21_sam_ba_arduino_mkr1000.bin

